

// UDP - chat(multicast) / TCP
// 0) клієнт - сервер - клієнт

// 0.1)  сервер знає імена + EndPoint учасників, зберігає історія чату
// 1) mvc патерн  (виносимо асинхронні методи відправки і отримання сповіщень в контроллер, форма викликає методи контроллера)

// 2) переписати код, додати інфо хто відправляє сповіщення
// Для цього для учасника чату організовуємо ввод свого ім'я, яке потім відображається в сповіщеннях

// 3) Додаємо окремо колонку : список учасників
// Клікаємо по учаснику --> переходимо у спілкування TCP, + кнопка виходу в загальний чат   (Server)
// +Class Message (Msg , Name) + JSON

namespace MessangerClient
{
    public partial class MessengerUI : Form
    {
        public MessengerUI()
        {
            InitializeComponent();
        }
    }
}
